#include <stdio.h>
#include <stdlib.h>
#include <math.h> 
#include <time.h>

int main() {
    int choice;

    while (1) { // нереально классна менюшка
        printf("\n--Меню--\n");
        printf("1. Завдання 1\n");
        printf("2. Завдання 2\n");
        printf("0. Вийти\n");
        printf("Ваш вибір: ");
        scanf("%d", &choice);

        if (choice == 1) {
            int n, m; // змінні для розміру масиву та порівняльного значення

            printf("\nЗавдання 1: Обчислити суму та кількість елементів з непарними номерами, які більші за значення m.\n");

            while (1) { // Цикл для повторного введення, якщо умова не виконується
                printf("Введіть кількість елементів масиву n: ");
                scanf("%d", &n);

                if (n <= 0) { // Перевірка на коректність введення n
                    printf("Помилка! n має бути більше 0.\n");
                    continue;
                }

                int arr[n]; // оголошення масиву з n елементів
                printf("Введена кількість масивів %d:\n", n);
                for (int i = 0; i < n; i++) { // Цикл для зчитування всіх n елементів масиву з клавіатури.
                    printf("a[%d] = ", i); // виводимо індекс елемента
                    scanf("%d", &arr[i]);
                }

                printf("Введіть значення m: "); // число, з яким порівнюються елементи масиву
                scanf("%d", &m);

                int sum = 0, count = 0; // змінні для суми та кількості елементів

                // Непарні номери — це індекси 1,3,5,... (тобто i % 2 == 1)
                for (int i = 1; i < n; i += 2) { // Цикл для перебору елементів з непарними номерами 
                    if (arr[i] > m) { // Якщо елемент більший за m, він додається до sum, а count збільшується.
                        sum += arr[i];
                        count++;
                    }
                }

                if (count == 0) {
                    printf("Помилка! Немає жодного елемента з непарним номером, який більший за m. Повторіть введення.\n\n");
                    continue;
                }

                printf("Сума = %d\n", sum);
                printf("Кількість = %d\n", count);
                break;
            }
        }
        else if (choice == 2) {
            int loop_choice;
            printf("Завдання 2: Знайти індекс максимального за модулем елемента та добуток елементів після першого додатного.\n");
            printf("Виберіть варіант: \n");
            printf("1. Варіант А) З клавіатури вводиться одновимірний масив n цілих чисел.\n");
            printf("2. Варіант Б) Генерується масив n цілих чисел з відрізка [-100; 100].\n");
            printf("0. Повернутись у головне меню.\n");
            printf("Ваш вибір: ");
            scanf("%d", &loop_choice);

            if (loop_choice == 0) {
                printf("Повернення у головне меню.\n");
            }
            
            else if (loop_choice == 1) {
                printf ("Варіант A\n");
            int n; // змінна для розміру масиву
            printf("Введіть розмір масиву n: "); 
            scanf("%d", &n);
        
            int arr[n]; //масив цілих чисел розміром яку ми впишемо в змінну n
            printf("Введіть %d цілих елементів масиву:\n", n);
            if (n <= 0) { // Перевірка на коректність введення n
                printf("Помилка! n має бути більше 0.\n");
                continue; // Повертаємося до початку циклу, щоб знову запитати розмір масиву
            }
            for (int i = 0; i < n; i++) { // Цикл для зчитування всіх n елементів масиву
                printf("a[%d] = ", i); // виводимо індекс елемента 
                scanf("%d", &arr[i]); // виводиться значення елемента масиву
            }
        
            // 1) Знаходимо індекс максимального за модулем елемента
            int max_index = 0; // max_index змінна де зберігається індекс найбільшого за модулем елемента
            for (int i = 1; i < n; i++) { 
                if (abs(arr[i]) > abs(arr[max_index])) { // порівнюємо модулі елементів 
                    // Якщо модуль поточного елемента більший за модуль елемента з max_index 
                    max_index = i; // дорівнюємо max_index до i, тобто індексу поточного елемента
                }
            }
            printf("Номер (індекс) максимального за модулем елемента: %d\n", max_index);
        
            // 2) Добуток елементів після першого додатного
            int first_pos_index = -1;  // Знаходимо індекс першого додатного елемента 
            for (int i = 0; i < n; i++) {  // Цикл для пошуку першого додатного елемента
                if (arr[i] > 0) {    
                    first_pos_index = i; // Якщо знайдено додатний елемент, зберігаємо його індекс
                    break; 
                }
            }
        
            if (first_pos_index == -1 || first_pos_index == n - 1) { // після нього нічого немає, добуток не рахується, повертається 1.
                printf("Немає додатного елемента або він останній. Добуток = 1\n"); 
            } else { //обчислюється добуток усіх елементів після першого додатного
                int product = 1;
                for (int i = first_pos_index + 1; i < n; i++) {
                    product *= arr[i]; // множимо всі елементи після першого додатного
                }
                printf("Добуток елементів після першого додатного: %d\n", product);
            }
        }
        else if (loop_choice == 2) {
            printf ("Варіант B\n");
            int n; // змінна для розміру масиву
            printf("Введіть розмір масиву n: ");
            scanf("%d", &n);

            int arr[n]; // масив цілих чисел розміром яку ми впишемо в змінну n
            if (n <= 0) {
                printf("Помилка! n має бути більше 0.\n");
                continue; // Повертаємося до початку циклу, щоб знову запитати розмір масиву
            }

            srand(time(0));
            printf("Згенерований масив:\n");
            for (int i = 0; i < n; i++) { // Цикл для генерації масиву з n елементів
                arr[i] = -100 + rand() % 201; // [-100; 100]
                printf("a[%d] = %d\n", i, arr[i]);
            }

            // 1) Знаходимо індекс максимального за модулем елемента
            int max_index = 0; 
            for (int i = 1; i < n; i++) {  
                if (abs(arr[i]) > abs(arr[max_index])) {  // порівнюємо модулі елементів
                // Якщо модуль поточного елемента більший за модуль елемента з max_index то оновлюємо max_index
                    max_index = i; 
                }
            }
            printf("Номер (індекс) максимального за модулем елемента: %d\n", max_index);

            // 2) Добуток елементів після першого додатного
            int first_pos_index = -1; // Знаходимо індекс першого додатного елемента
            for (int i = 0; i < n; i++) { // Цикл для пошуку першого додатного елемента
                if (arr[i] > 0) { 
                    first_pos_index = i; // Якщо знайдено додатний елемент, зберігаємо його індекс
                    break; 
                }
            }
            // якщо немає додатного елемента або він останній, то добуток не рахується, повертається 1.
            if (first_pos_index == -1 || first_pos_index == n - 1) { 
                printf("Немає додатного елемента або він останній. Добуток = 1\n");
            } else {
                int product = 1; 
                // обчислюється добуток усіх елементів після першого додатного
                for (int i = first_pos_index + 1; i < n; i++) { 
                    product *= arr[i]; // множимо всі елементи після першого додатного
                }
                printf("Добуток елементів після першого додатного: %d\n", product);
            }
        } else {
            printf("Неправильний вибір. Спробуйте ще раз.\n");
        }
    }
        
        else if (choice == 0) {
            printf("Вихід з програми.\n");
            break;
        }
        else {
            printf("Неправильний вибір. Спробуйте ще раз.\n");
        }
    }

    return 0;
}